{"loss": "categorical_crossentropy", "optimizer": {"clipnorm": 15, "name": "SGD", "decay": 9.999999974752427e-07, "nesterov": true, "lr": 0.0020000000949949026, "momentum": 0.8999999761581421}, "class_name": "Sequential", "keras_version": "1.0.6", "config": [{"class_name": "Embedding", "config": {"trainable": false, "name": "embedding_1", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 495, "batch_input_shape": [null, 100], "W_regularizer": null, "dropout": 0.0, "output_dim": 400, "input_length": 100}}, {"class_name": "LSTM", "config": {"U_regularizer": {"l2": 0.009999999776482582, "name": "WeightRegularizer", "l1": 0.0}, "name": "lstm_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.2, "dropout_W": 0.2, "input_dim": 400, "return_sequences": true, "b_regularizer": {"l2": 0.009999999776482582, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 0.009999999776482582, "name": "WeightRegularizer", "l1": 0.0}, "output_dim": 128, "forget_bias_init": "one", "input_length": null}}, {"class_name": "LSTM", "config": {"U_regularizer": {"l2": 0.009999999776482582, "name": "WeightRegularizer", "l1": 0.0}, "name": "lstm_2", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.2, "dropout_W": 0.2, "input_dim": 128, "return_sequences": false, "b_regularizer": {"l2": 0.009999999776482582, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 0.009999999776482582, "name": "WeightRegularizer", "l1": 0.0}, "output_dim": 128, "forget_bias_init": "one", "input_length": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 3}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}], "sample_weight_mode": null}