{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"name": "dense_31", "W_constraint": null, "activation": "linear", "batch_input_shape": [null, 763], "input_dim": 763, "bias": true, "W_regularizer": null, "input_dtype": "float32", "b_regularizer": null, "output_dim": 2000, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "b_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_32", "W_constraint": null, "activation": "linear", "input_dim": null, "b_regularizer": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "output_dim": 1000, "init": "glorot_uniform", "trainable": true, "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_16", "p": 0.5, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_13", "mode": 0, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "epsilon": 0.0001, "axis": -1, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_33", "W_constraint": null, "activation": "linear", "input_dim": null, "b_regularizer": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "output_dim": 500, "init": "glorot_uniform", "trainable": true, "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_17", "p": 0.5, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_14", "mode": 0, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "epsilon": 0.0001, "axis": -1, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_34", "W_constraint": null, "activation": "linear", "input_dim": null, "b_regularizer": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "output_dim": 200, "init": "glorot_uniform", "trainable": true, "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_18", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_35", "W_constraint": null, "activation": "linear", "input_dim": null, "b_regularizer": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "trainable": true, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "sigmoid", "trainable": true}}], "keras_version": "1.1.2"}