{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"input_dim": 763, "W_constraint": null, "W_regularizer": null, "batch_input_shape": [null, 763], "init": "glorot_uniform", "trainable": true, "bias": true, "output_dim": 2000, "input_dtype": "float32", "b_regularizer": null, "activation": "linear", "b_constraint": null, "activity_regularizer": null, "name": "dense_1"}}, {"class_name": "Dense", "config": {"input_dim": null, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "output_dim": 1000, "b_regularizer": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "name": "dense_2"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.0001, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "mode": 0, "axis": -1, "beta_regularizer": null, "name": "batchnormalization_1"}}, {"class_name": "Dense", "config": {"input_dim": null, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "output_dim": 500, "b_regularizer": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "name": "dense_3"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.0001, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "mode": 0, "axis": -1, "beta_regularizer": null, "name": "batchnormalization_2"}}, {"class_name": "Dense", "config": {"input_dim": null, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "output_dim": 200, "b_regularizer": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "name": "dense_4"}}, {"class_name": "Dense", "config": {"input_dim": null, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "output_dim": 1, "b_regularizer": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "name": "dense_5"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}}], "keras_version": "1.1.2"}